app/Controllers/ProdukController.php

SELECT *
FROM `product`
WHERE `product`.`id` = '5'
UPDATE `product` SET `nama` = 'Nmax New ', `harga` = '33000000', `jumlah` = '10', `updated_at` = '2025-06-20 15:10:06', `foto` = '1750407006_6da1b6f282b9c4d4ec2e.jpg'
WHERE `product`.`id` IN ('5')
---
    public function edit($id)
{
    $dataProduk = $this->product->find($id);

    $dataForm = [
        'nama' => $this->request->getPost('nama'),
        'harga' => $this->request->getPost('harga'),
        'jumlah' => $this->request->getPost('jumlah'),
        date_default_timezone_set('Asia/Jakarta'),
        'updated_at' => date("Y-m-d H:i:s")
    ];

    if ($this->request->getPost('check') == 1) {
        if ($dataProduk['foto'] != '' and file_exists("img/" . $dataProduk['foto'] . "")) {
            unlink("img/" . $dataProduk['foto']);
        }

        $dataFoto = $this->request->getFile('foto');

        if ($dataFoto->isValid()) {
            $fileName = $dataFoto->getRandomName();
            $dataFoto->move('img/', $fileName);
            $dataForm['foto'] = $fileName;
        }
    }

    $this->product->update($id, $dataForm);